CAnimationBaseObject.SetUserData(System.UInt32!System.Runtime.CompilerServices.IsLong)
Sets user-defined data.
Remarks:
Use this method to associate a custom data with an animation object. This data may be retrieved later at runtime by GetUserData.
dwUserData: Specifies the custom data.

CAnimationBaseObject.#ctor(System.UInt32,System.UInt32,System.UInt32!System.Runtime.CompilerServices.IsLong)
Constructs an animation object.
Remarks:
Constructs an animation object with specified Object ID and Group ID.
nGroupID: Specifies Group ID.
nObjectID: Specifies Object ID.
dwUserData: User-defined data, which can be associated with animation object and retrieved later at runtime.